# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
# brew 'bash'

# Install more recent versions of some macOS tools
# brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'ctags'
brew 'dnsmasq'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'trash'
brew 'wget'
brew 'ssh-copy-id'

# Development
brew 'php71', args: ['with-debug']
brew 'php71-intl'
brew 'mariadb'

# Apps
cask 'aerial'
cask 'bettertouchtool'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive'
cask 'macvim'
cask 'imageoptim'
cask 'sequel-pro'
cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tower'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

cask 'adobe-creative-cloud'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Install Mac App Store apps
# mas 'Giphy Capture', id: 668208984
