# Taps
tap 'hombrew/cask'
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap 'hombrew/cask-fonts'
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
# brew 'bash'

# Install more recent versions of some macOS tools
# brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'ansible'
brew 'git'
brew 'ctags'
brew 'dnsmasq'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'trash'
brew 'wget'
brew 'ssh-copy-id'

# Development
brew 'php73', args: ['with-debug']
brew 'php73-intl'
brew 'mariadb'

# Apps
cask 'aerial'
cask 'bettertouchtool'
cask 'docker'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask "google-backup-and-sync"
cask 'macvim'
cask 'imageoptim'
cask 'shuttle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tower'
cask 'transmit'
cask 'visual-studio-code'
cask 'unity-hub'
cask 'vlc'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Install Mac App Store apps
# mas 'Giphy Capture', id: 668208984
